{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Refund_not_showing_up",
    "1": "activate_my_card",
    "2": "age_limit",
    "3": "apple_pay_or_google_pay",
    "4": "atm_support",
    "5": "automatic_top_up",
    "6": "balance_not_updated_after_bank_transfer",
    "7": "balance_not_updated_after_cheque_or_cash_deposit",
    "8": "beneficiary_not_allowed",
    "9": "cancel_transfer",
    "10": "card_about_to_expire",
    "11": "card_acceptance",
    "12": "card_arrival",
    "13": "card_delivery_estimate",
    "14": "card_linking",
    "15": "card_not_working",
    "16": "card_payment_fee_charged",
    "17": "card_payment_not_recognised",
    "18": "card_payment_wrong_exchange_rate",
    "19": "card_swallowed",
    "20": "cash_withdrawal_charge",
    "21": "cash_withdrawal_not_recognised",
    "22": "change_pin",
    "23": "compromised_card",
    "24": "contactless_not_working",
    "25": "country_support",
    "26": "declined_card_payment",
    "27": "declined_cash_withdrawal",
    "28": "declined_transfer",
    "29": "direct_debit_payment_not_recognised",
    "30": "disposable_card_limits",
    "31": "edit_personal_details",
    "32": "exchange_charge",
    "33": "exchange_rate",
    "34": "exchange_via_app",
    "35": "extra_charge_on_statement",
    "36": "failed_transfer",
    "37": "fiat_currency_support",
    "38": "get_disposable_virtual_card",
    "39": "get_physical_card",
    "40": "getting_spare_card",
    "41": "getting_virtual_card",
    "42": "lost_or_stolen_card",
    "43": "lost_or_stolen_phone",
    "44": "neutral",
    "45": "order_physical_card",
    "46": "passcode_forgotten",
    "47": "pending_card_payment",
    "48": "pending_cash_withdrawal",
    "49": "pending_top_up",
    "50": "pending_transfer",
    "51": "pin_blocked",
    "52": "receiving_money",
    "53": "request_refund",
    "54": "reverted_card_payment?",
    "55": "supported_cards_and_currencies",
    "56": "terminate_account",
    "57": "top_up_by_bank_transfer_charge",
    "58": "top_up_by_card_charge",
    "59": "top_up_by_cash_or_cheque",
    "60": "top_up_failed",
    "61": "top_up_limits",
    "62": "top_up_reverted",
    "63": "topping_up_by_card",
    "64": "transaction_charged_twice",
    "65": "transfer_fee_charged",
    "66": "transfer_into_account",
    "67": "transfer_not_received_by_recipient",
    "68": "transfer_timing",
    "69": "unable_to_verify_identity",
    "70": "verify_my_identity",
    "71": "verify_source_of_funds",
    "72": "verify_top_up",
    "73": "virtual_card_not_working",
    "74": "visa_or_mastercard",
    "75": "why_verify_identity",
    "76": "wrong_amount_of_cash_received",
    "77": "wrong_exchange_rate_for_cash_withdrawal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Refund_not_showing_up": 0,
    "activate_my_card": 1,
    "age_limit": 2,
    "apple_pay_or_google_pay": 3,
    "atm_support": 4,
    "automatic_top_up": 5,
    "balance_not_updated_after_bank_transfer": 6,
    "balance_not_updated_after_cheque_or_cash_deposit": 7,
    "beneficiary_not_allowed": 8,
    "cancel_transfer": 9,
    "card_about_to_expire": 10,
    "card_acceptance": 11,
    "card_arrival": 12,
    "card_delivery_estimate": 13,
    "card_linking": 14,
    "card_not_working": 15,
    "card_payment_fee_charged": 16,
    "card_payment_not_recognised": 17,
    "card_payment_wrong_exchange_rate": 18,
    "card_swallowed": 19,
    "cash_withdrawal_charge": 20,
    "cash_withdrawal_not_recognised": 21,
    "change_pin": 22,
    "compromised_card": 23,
    "contactless_not_working": 24,
    "country_support": 25,
    "declined_card_payment": 26,
    "declined_cash_withdrawal": 27,
    "declined_transfer": 28,
    "direct_debit_payment_not_recognised": 29,
    "disposable_card_limits": 30,
    "edit_personal_details": 31,
    "exchange_charge": 32,
    "exchange_rate": 33,
    "exchange_via_app": 34,
    "extra_charge_on_statement": 35,
    "failed_transfer": 36,
    "fiat_currency_support": 37,
    "get_disposable_virtual_card": 38,
    "get_physical_card": 39,
    "getting_spare_card": 40,
    "getting_virtual_card": 41,
    "lost_or_stolen_card": 42,
    "lost_or_stolen_phone": 43,
    "neutral": 44,
    "order_physical_card": 45,
    "passcode_forgotten": 46,
    "pending_card_payment": 47,
    "pending_cash_withdrawal": 48,
    "pending_top_up": 49,
    "pending_transfer": 50,
    "pin_blocked": 51,
    "receiving_money": 52,
    "request_refund": 53,
    "reverted_card_payment?": 54,
    "supported_cards_and_currencies": 55,
    "terminate_account": 56,
    "top_up_by_bank_transfer_charge": 57,
    "top_up_by_card_charge": 58,
    "top_up_by_cash_or_cheque": 59,
    "top_up_failed": 60,
    "top_up_limits": 61,
    "top_up_reverted": 62,
    "topping_up_by_card": 63,
    "transaction_charged_twice": 64,
    "transfer_fee_charged": 65,
    "transfer_into_account": 66,
    "transfer_not_received_by_recipient": 67,
    "transfer_timing": 68,
    "unable_to_verify_identity": 69,
    "verify_my_identity": 70,
    "verify_source_of_funds": 71,
    "verify_top_up": 72,
    "virtual_card_not_working": 73,
    "visa_or_mastercard": 74,
    "why_verify_identity": 75,
    "wrong_amount_of_cash_received": 76,
    "wrong_exchange_rate_for_cash_withdrawal": 77
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
